# Mundo 16

### Limpeza e tratamento de dados

In [1]:
import pandas as pd
import yfinance as yf

/home/vinicius/.local/lib/python3.8/site-packages/pandas/core/computation/expressions.py:20: UserWarning: Pandas requires version '2.7.3' or newer of 'numexpr' (version '2.7.1' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED

In [5]:
dados_acao = yf.download(["CASH3.SA", 'VALE3.SA'], "2015-01-01", "2022-01-01")['Adj Close']
dados_acao

[*********************100%***********************]  2 of 2 completed

            CASH3.SA   VALE3.SA
Date
2015-01-02       NaN  13.397048
2015-01-05       NaN  13.195587
2015-01-06       NaN  13.724419
2015-01-07       NaN  14.228065
2015-01-08       NaN  14.379161
...              ...        ...
2021-12-23      3.10  72.218056
2021-12-27      3.11  72.035568
2021-12-28      3.08  70.301979
2021-12-29      3.01  70.484459
2021-12-30      3.24  71.132271

[1738 rows x 2 columns]

In [6]:
dados_teste = pd.DataFrame({'empresa': ['Weg', 'Petrobras', 'Vale', pd.NA],
                           'cotacao': [20, 50, pd.NA, pd.NA],
                           'volume': [3000, pd.NA, pd.NA ,pd.NA]})

dados_teste

     empresa cotacao volume
0        Weg      20   3000
1  Petrobras      50   <NA>
2       Vale    <NA>   <NA>
3       <NA>    <NA>   <NA>

In [7]:
#tirando dados ausentes

dados_acao = dados_acao.dropna()

dados_acao

            CASH3.SA   VALE3.SA
Date
2020-11-09  1.579895  49.010887
2020-11-10  1.631504  48.987621
2020-11-11  1.639828  49.328884
2020-11-12  1.589884  48.607571
2020-11-13  1.623181  49.057423
...              ...        ...
2021-12-23  3.100000  72.218056
2021-12-27  3.110000  72.035568
2021-12-28  3.080000  70.301979
2021-12-29  3.010000  70.484459
2021-12-30  3.240000  71.132271

[282 rows x 2 columns]

In [8]:
#qualquer na
print(dados_teste.dropna())

#todas as colunas tem que ser NA
print(dados_teste.dropna(how = "all"))

#duas colunas como NA

dados_teste.dropna(subset = ['empresa', 'cotacao'])

  empresa cotacao volume
0     Weg      20   3000
     empresa cotacao volume
0        Weg      20   3000
1  Petrobras      50   <NA>
2       Vale    <NA>   <NA>

     empresa cotacao volume
0        Weg      20   3000
1  Petrobras      50   <NA>

In [9]:
#prenchendo dados ausentes

print(dados_teste.fillna(0))

dados_teste.fillna({'empresa':'Nenhuma', 
                    'cotacao': 0, 
                    'volume': -10})

     empresa  cotacao  volume
0        Weg       20    3000
1  Petrobras       50       0
2       Vale        0       0
3          0        0       0

     empresa  cotacao  volume
0        Weg       20    3000
1  Petrobras       50     -10
2       Vale        0     -10
3    Nenhuma        0     -10

In [15]:
cotacoes = pd.Series([20, pd.NA, pd.NA, pd.NA, 23, 24, pd.NA, 25], 
                     index = pd.date_range("2022-06-30", freq = "M", periods = 8))
                                           

cotacoes

2022-06-30      20
2022-07-31    <NA>
2022-08-31    <NA>
2022-09-30    <NA>
2022-10-31      23
2022-11-30      24
2022-12-31    <NA>
2023-01-31      25
Freq: M, dtype: object

In [16]:
print(cotacoes.fillna(method = 'ffill'))

cotacoes.fillna(method = 'ffill', limit = 2)

2022-06-30    20
2022-07-31    20
2022-08-31    20
2022-09-30    20
2022-10-31    23
2022-11-30    24
2022-12-31    24
2023-01-31    25
Freq: M, dtype: int64

2022-06-30      20
2022-07-31      20
2022-08-31      20
2022-09-30    <NA>
2022-10-31      23
2022-11-30      24
2022-12-31      24
2023-01-31      25
Freq: M, dtype: object

In [17]:
cotacoes.fillna(cotacoes.mean())

2022-06-30    20.0
2022-07-31    23.0
2022-08-31    23.0
2022-09-30    23.0
2022-10-31    23.0
2022-11-30    24.0
2022-12-31    23.0
2023-01-31    25.0
Freq: M, dtype: float64

# Exercícios

* Exercício 64: Puxe dados de cotação ajustadas das empresas PETR4.SA, LJQQ3.SA e CASH3.SA desde 2015. Crie um dataframe que não possua nenhum dado faltante em nenhuma coluna e, em seguida, um dataframe que filtre NA da coluna LJQQ3 mas aceite NA em CASH3.
<br>

* Exercício 65: Leia a planilha disponibilizada na aula com as cotações reais de EUCA3 desde 25/05/2022 até 22/09/2022. Preencha as cotações faltantes com o método ffill limitando a dois dias de preenchimento. Obs: Preste atenção se o valor que veio do excel é realmente um NA!

In [3]:
#gabarito 64

acoes = ['PETR4.SA', 'LJQQ3.SA', 'CASH3.SA']
inicio = '2015-01-01'
final = '2022-01-01'

dados_cotacoes = yf.download(acoes, inicio, final)['Adj Close']

dados_cotacoes_sem_na = dados_cotacoes.dropna()

dados_cotacoes_sem_na_ljqq = dados_cotacoes.dropna(subset = ['LJQQ3.SA'])

print(dados_cotacoes)
print(dados_cotacoes_sem_na)
print(dados_cotacoes_sem_na_ljqq)

[*********************100%***********************]  3 of 3 completed
            CASH3.SA  LJQQ3.SA   PETR4.SA
Date
2015-01-02       NaN       NaN   4.124554
2015-01-05       NaN       NaN   3.772028
2015-01-06       NaN       NaN   3.648644
2015-01-07       NaN       NaN   3.820500
2015-01-08       NaN       NaN   4.067269
...              ...       ...        ...
2021-12-23      3.10     10.93  16.556160
2021-12-27      3.11     11.24  16.801607
2021-12-28      3.08     11.38  16.819141
2021-12-29      3.01     10.96  16.678885
2021-12-30      3.24     11.19  16.626289

[1738 rows x 3 columns]
            CASH3.SA   LJQQ3.SA   PETR4.SA
Date
2020-11-09  1.579895  14.748903  10.264722
2020-11-10  1.631504  14.011457  10.962970
2020-11-11  1.639828  14.650577  10.867971
2020-11-12  1.589884  14.208110  10.407223
2020-11-13  1.623181  14.660409  10.749221
...              ...        ...        ...
2021-12-23  3.100000  10.930000  16.556160
2021-12-27  3.110000  11.240000  16.801607
2021-12-28  3.080000  11.380000  16.819141
2021-12-29  3.010000  10.960000  16.678885
2021-12-30  3.240000  11.190000  16.626289

[282 rows x 3 columns]
            CASH3.SA   LJQQ3.SA   PETR4.SA
Date
2020-08-10       NaN  12.575898  11.138720
2020-08-11       NaN  12.536567  10.962970
2020-08-12       NaN  12.438241  11.152969
2020-08-13       NaN  12.684056  10.848970
2020-08-14       NaN  13.274013  10.768221
...              ...        ...        ...
2021-12-23      3.10  10.930000  16.556160
2021-12-27      3.11  11.240000  16.801607
2021-12-28      3.08  11.380000  16.819141
2021-12-29      3.01  10.960000  16.678885
2021-12-30      3.24  11.190000  16.626289

[344 rows x 3 columns]

In [4]:
#gabarito 65 

dados_euca3 = pd.read_excel('dados_euca3.xlsx', na_values = "nd")

dados_euca3_tratado = dados_euca3.fillna(method = 'ffill', limit = 2)

dados_euca3_tratado.tail(50)

         Data  EUCA3
35 2022-08-03  13.41
36 2022-08-02  13.86
37 2022-08-01  13.30
38 2022-07-29  13.84
39 2022-07-28  13.84
40 2022-07-27  13.99
41 2022-07-26  13.99
42 2022-07-25  14.08
43 2022-07-22  13.39
44 2022-07-21  13.00
45 2022-07-20  13.25
46 2022-07-19  13.25
47 2022-07-18  12.96
48 2022-07-15  12.80
49 2022-07-14  12.80
50 2022-07-13  12.91
51 2022-07-12  12.91
52 2022-07-11  12.91
53 2022-07-08    NaN
54 2022-07-07  12.91
55 2022-07-06  12.91
56 2022-07-05  13.16
57 2022-07-04  13.38
58 2022-07-01  13.38
59 2022-06-30  12.87
60 2022-06-29  12.99
61 2022-06-28  13.15
62 2022-06-27  13.31
63 2022-06-24  14.09
64 2022-06-23  14.09
65 2022-06-22  14.10
66 2022-06-21  14.22
67 2022-06-20  14.22
68 2022-06-17  14.22
69 2022-06-15  14.39
70 2022-06-14  14.50
71 2022-06-13  14.30
72 2022-06-10  15.00
73 2022-06-09  15.00
74 2022-06-08  15.34
75 2022-06-07  15.34
76 2022-06-06  15.30
77 2022-06-03  15.38
78 2022-06-02  15.38
79 2022-06-01  15.39
80 2022-05-31  15.64
81 2022-05-30  15.68
82 2022-05-27  15.77
83 2022-05-26  15.43
84 2022-05-25  15.28

# Mundo 17 

Para seguir nosso aprendizado no tratamento de dados, temos que aprender a lidar com valores duplicados dentro dos nossos dataframes. Como podemos, por exemplo, selecionar o código de negociação com maior liquidez em um dia específico?